In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/018.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

        0    1    2                   3                   4
0     NaN  NaN  NaN  Hughes (R)  41,967  Bishop (D)  88,662
1     NaN  NaN  NaN               32.1%               67.9%
2  County   PR   TP                 NaN                 NaN
3   BAKER    7    7                 269                 715
4  BROOKS   11   11                1165                2118

In [5]:
df = df[3:]

In [6]:
df.head(5)

               0   1   2     3     4
3          BAKER   7   7   269   715
4         BROOKS  11  11  1165  2118
5        CALHOUN   7   7   293   940
6  CHATTAHOOCHEE   3   3   298   605
7           CLAY   7   7   238   568

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

               0     3     4
3          BAKER   269   715
4         BROOKS  1165  2118
5        CALHOUN   293   940
6  CHATTAHOOCHEE   298   605
7           CLAY   238   568

In [9]:
df.columns = ['county', 'Bradley C. Hughes', 'Sanford Bishop']

In [10]:
df.tail(5)

     county Bradley C. Hughes Sanford Bishop
30   TAYLOR               871           1099
31  TERRELL               779           1840
32   THOMAS              4466           5193
33  WEBSTER               185            445
34    WORTH              1468           2142

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

          county          candidate votes
0          BAKER  Bradley C. Hughes   269
1         BROOKS  Bradley C. Hughes  1165
2        CALHOUN  Bradley C. Hughes   293
3  CHATTAHOOCHEE  Bradley C. Hughes   298
4           CLAY  Bradley C. Hughes   238

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64 entries, 0 to 63
Data columns (total 3 columns):
county       64 non-null object
candidate    64 non-null object
votes        64 non-null int64
dtypes: int64(1), object(2)
memory usage: 1.6+ KB

In [16]:
df['office'] = 'U.S. Representative'

In [17]:
df['district'] = '2'

In [18]:
df['party'] = ''

In [19]:
df.loc[df['candidate'] == 'Bradley C. Hughes', 'party'] = 'Republican'
df.loc[df['candidate'] == 'Sanford Bishop', 'party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate          party
Bradley C. Hughes  Republican    41967
Sanford Bishop     Democrat      88662
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,BAKER,U.S. Representative,2,Republican,Bradley C. Hughes,269
1,BROOKS,U.S. Representative,2,Republican,Bradley C. Hughes,1165
2,CALHOUN,U.S. Representative,2,Republican,Bradley C. Hughes,293
3,CHATTAHOOCHEE,U.S. Representative,2,Republican,Bradley C. Hughes,298
4,CLAY,U.S. Representative,2,Republican,Bradley C. Hughes,238

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')